Documents/ВыдачаДисконтныйКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВыдачаДисконтныйКарт</Name>
			<BasedOn>
				<xr:Item>Document.Запрос</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговаяКампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаСделку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгодоприобретатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID_Взаимодействия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыдачаДисконтныйКарт/Forms/ФормаВыбораДисконтнойКарты/Ext/Form/Module.bsl
&НаКлиенте 
Перем ЗакрытиеФормы;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//МассивЭлементовКУдалению = Новый Массив;
	//Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
	//		Для Каждого ЭлементГруппы Из ЭлементОтбора.Элементы Цикл
	//			ЭлементГруппы.Использование = Ложь;
	//		КонецЦикла;
	//	Иначе
	//		МассивЭлементовКУдалению.Добавить(ЭлементОтбора.ЛевоеЗначение);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для каждого Настройка Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//	Если ТипЗнч(Настройка) = Тип("ОтборКомпоновкиДанных") Тогда
	//		Настройка.Элементы.Очистить();
	//	КонецЕсли;
	//КонецЦикла; 
	//
	//Для Каждого Элемент Из МассивЭлементовКУдалению Цикл
	//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, Элемент);
	//КонецЦикла;
	
	Если Параметры.Свойство("КлючЗаписи") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.КлючЗаписи; 	
	КонецЕсли;
	
	Если Параметры.Свойство("МаркетинговаяКомпания") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "МаркетинговаяКампания", Параметры.МаркетинговаяКомпания, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);			
	КонецЕсли;

	Если Параметры.Свойство("Использована") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Использована", Параметры.Использована, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
			
	Если Параметры.Свойство("Выгодоприобретатели") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Выгодоприобретатель", Параметры.Выгодоприобретатели, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
		Если ТипЗнч(ЗакрытиеФормы) = Тип("Булево") И ЗакрытиеФормы Тогда
  	  		Возврат;
		КонецЕсли;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;	
		КонецЕсли;	
		СтандартнаяОбработка = Ложь;
		ЗакрытиеФормы = Истина;
		Закрыть(Новый Структура("ДисконтаняКарта", Элементы.Список.ТекущаяСтрока));			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ЗакрытиеФормы = Истина;
	Закрыть(Новый Структура("ДисконтаняКарта", Элементы.Список.ТекущаяСтрока));
	
КонецПроцедуры
